timothy9079/solt_epd60/Projects/STM32WB5MM-DK/Applications/BLE/BLE_HeartRate/STM32CubeIDE/Device/Rf/inc/CMT2310A_reg.h
/*
 * THE FOLLOWING FIRMWARE IS PROVIDED: (1) "AS IS" WITH NO WARRANTY; AND
 * (2)TO ENABLE ACCESS TO CODING INFORMATION TO GUIDE AND FACILITATE CUSTOMER.
 * CONSEQUENTLY, CMOSTEK SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT
 * OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION
 * CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * Copyright (C) CMOSTEK SZ.
 */

/*!
 * @file    CMT2310A_reg.h
 * @brief   CMT2310A transceiver RF chip driver
 *
 * @version 1.0
 * @date    Dec 7 2021
 * @author  CMOSTEK R&D
 */
 

#ifndef __CMT2310A_REG_H

	#define 	__CMT2310A_REG_H

	#define 		CMT2310A_PAGE0_SIZE         (0x77-0x28+1)
	#define 		CMT2310A_PAGE1_SIZE         (0xef-0x80+1)
	#define 		CMT2310A_PAGE2_SIZE         (0x3f-0x00+1)

//---------------------- CUS PAGE0 defines -------------------------------
//------------------------------------------------------------------------	
	#define 		CMT2310A_CTL_REG_00         	0x00					// PU_BOOT<7:0>
		#define		CMT2310A_REBOOT					0x03
							                    	
	#define 		CMT2310A_CTL_REG_01         	0x01					// radio chip status switch
		#define		CMT2310A_GO_SLEEP				(1<<0)					// radio go sleep
		#define		CMT2310A_GO_READY				(1<<1)					// radio go ready
		#define		CMT2310A_GO_TX					(1<<2)					// radio go tx
		#define		CMT2310A_GO_RX					(1<<3)					// radio go rx 
		#define		CMT2310A_GO_TFS					(1<<4)					// radio go tfs
		#define		CMT2310A_GO_RFS					(1<<5)					// radio go rfs
	                                            	
	#define 		CMT2310A_CTL_REG_02         	0x02					// Antenna Diversity
		#define		CMT2310A_ANT_DIV_MANU			(1<<1)					// 0=disable antenna diversity,  1=enable antenna diversity
		#define		CMT2310A_ANT_SELECT				(1<<0)					// 0=select antenna_1,           1=select antenna_2,  when antenna diversity manual active
	                                            	
	#define 		CMT2310A_CTL_REG_03         	0x03					// frequencry channel value, by manual set
	                                            	
	#define 		CMT2310A_CTL_REG_04         	0x04					// gpio ctrl 0
		#define		CMT2310A_TX_DIN_EN				(1<<6)					// 0=disable TX_DATA input to GPIO,  1=enable TX_DATA input to GPIO
                                                	
		#define		CMT2310A_GPIO1_SEL				(7<<3)					// masker
		#define		CMT2310A_GPIO1_DCLK				(0<<3)					// gpio1 as DCLK
		#define		CMT2310A_GPIO1_INT1				(1<<3)					// gpio1 as INT1
		#define		CMT2310A_GPIO1_INT2				(2<<3)					// gpio1 as INT2
		#define		CMT2310A_GPIO1_DOUT				(3<<3)					// goio1 as DOUT	
	                                            	
		#define		CMT2310A_GPIO0_SEL				(7<<0)					// masker
		#define		CMT2310A_GPIO0_DOUT				(0<<0)					// gpio0 as DOUT
		#define		CMT2310A_GPIO0_INT1				(1<<0)					// gpio0 as INT1
		#define		CMT2310A_GPIO0_INT2				(2<<0)					// gpio0 as INT2
		#define		CMT2310A_GPIO0_DCLK				(3<<0)					// goio0 as DCLK
		#define		CMT2310A_GPIO0_INT3				(6<<0)					// gpio0 as INT3
		                                        	
	#define 		CMT2310A_CTL_REG_05         	0x05					// gpio ctrl 1
		#define		CMT2310A_TX_DIN_SEL				(3<<6)					// masker
		#define		CMT2310A_TX_DIN_GPIO3			(0<<6)					// TX_DIN from GPIO3
		#define		CMT2310A_TX_DIN_GPIO4			(1<<6)					// TX_DIN from GPIO4
		#define		CMT2310A_TX_DIN_nIRQ			(2<<6)					// TX_DIN from nIRQ
	                                            	
		#define		CMT2310A_GPIO3_SEL				(7<<3)					//masker
		#define		CMT2310A_GPIO3_INT2				(0<<3)					// gpio3 as INT2
		#define		CMT2310A_GPIO3_INT1				(1<<3)					// gpio3 as INT1	
		#define		CMT2310A_GPIO3_DCLK				(2<<3)					// gpio3 as DCLK	
		#define		CMT2310A_GPIO3_DOUT				(3<<3)					// gpio3 as DOUT
		#define		CMT2310A_GPIO3_DIN				(5<<3)					// gpio3 as DIN (TX_DIN)
		                                        	
		#define		CMT2310A_GPIO2_SEL				(7<<0)					//masker
		#define		CMT2310A_GPIO2_INT1				(0<<0)					// gpio2 as INT1
		#define		CMT2310A_GPIO2_INT2				(1<<0)					// gpio2 as INT2
		#define		CMT2310A_GPIO2_DCLK				(2<<0)					// gpio2 as DCLK
		#define		CMT2310A_GPIO2_DOUT				(3<<0)					// gpio2 as DOUT
		#define		CMT2310A_GPIO2_INT3				(6<<0)					// gpio2 as INT3
			                                            	
	#define 		CMT2310A_CTL_REG_06         	0x06					// gpio ctrl 2
		#define		CMT2310A_DIG_CLKOUT_EN			(1<<6)					// 0=bypass,  1=enable digital clock out to GPIO4
                                                	
		#define		CMT2310A_GPIO5_SEL				(7<<3)					//masker
		#define		CMT2310A_GPIO5_nRST				(0<<3)					// gpio5 as nRST
		#define		CMT2310A_GPIO5_INT1				(1<<3)					// goio5 as INT1
		#define		CMT2310A_GPIO5_INT2				(2<<3)					// gpio5 as INT2
		#define		CMT2310A_GPIO5_DOUT				(3<<3)					// gpio5 as DOUT
		#define		CMT2310A_GPIO5_DCLK				(4<<3)					// gpio5 as DCLK
		                                        	
		#define		CMT2310A_GPIO4_SEL				(7<<0)					//masker
		#define		CMT2310A_GPIO4_DOUT				(0<<0)					// gpio4 as DOUT
		#define		CMT2310A_GPIO4_INT1				(1<<0)					// gpio4 as INT1
		#define		CMT2310A_GPIO4_INT2				(2<<0)					// gpio4 as INT2
		#define		CMT2310A_GPIO4_DCLK				(3<<0)					// gpio4 as DCLK
		#define		CMT2310A_GPIO4_DIN				(5<<0)					// gpio4 as DIN (TX_DIN)
		                                        	
	#define 		CMT2310A_CTL_REG_07        		0x07					// nIRQ select
		#define		CMT2310A_CTL_REG_07_MASK		(3<<6)
		#define		CMT2310A_LFXO_PAD_EN			(1<<5)					// 0=disable,       1=enable GPIO2 & GPIO3 as 32.768kHz crystal pin
		#define		CMT2310A_API_STOP				(1<<4)					// 0=API go on,     1=stop API
		#define		CMT2310A_SPI_3W_EN				(1<<3)					// 0=select SPI-4,  1=select SPI-3
		                                        	
		#define		CMT2310A_nIRQ_SEL				(7<<0)					//masker
		#define		CMT2310A_nIRQ_INT1				(0<<0)					// nIRQ as INT1
		#define		CMT2310A_nIRQ_INT2				(1<<0)					// nIRQ as INT2
		#define		CMT2310A_nIRQ_DCLK				(2<<0)					// nIRQ as DCLK
		#define		CMT2310A_nIRQ_DOUT				(3<<0)					// nIRQ as DOUT
		#define		CMT2310A_nIRQ_TCXO				(4<<0)					// nIRQ as TCXO control pin
		#define		CMT2310A_nIRQ_DIN				(5<<0)					// nIRQ as DIN (TX_DIN)	
		                                        	
	#define 		CMT2310A_CTL_REG_08        		0x08					//API Command interface
		#define		CMT2310A_API_CMD_REG			0x08
		                                        	
