timothy9079/solt_epd60/Projects/STM32WB5MM-DK/Applications/BLE/BLE_HeartRate/STM32CubeIDE/Device/Rf/inc/CMT2310A_reg.h
	#define 		CMT2310A_CTL_REG_09        		0x09
		#define		CMT2310A_API_CMD_FLAG			(1<<7)					//API Command flag
		#define		CMT2310A_API_RESP_MASK			0x7F					//API Respond value
                                                	
	#define 		CMT2310A_CTL_REG_10         	0x0A					// radio status register 	(-RO)
		#define		CMT2310A_CHIP_MODE_STA_REG		0x0A					// 	
		#define		CMT2310A_STATE_IS_IDLE			0x00					// radio is in idle
		#define		CMT2310A_STATE_IS_SLEEP			0x81					// radio is in sleep
		#define		CMT2310A_STATE_IS_READY			0x82					// radio is in ready
		#define		CMT2310A_STATE_IS_RFS			0x84					// radio is in RFS
		#define		CMT2310A_STATE_IS_TFS			0x88					// radio is in TFS
		#define		CMT2310A_STATE_IS_RX			0x90					// radio is in RX
		#define		CMT2310A_STATE_IS_TX			0xA0					// radio is in TX
	                                            	
	#define 		CMT2310A_CTL_REG_11         	0x0B					// auto frequencry hopping done times		
																			// range 0-63
                                                	
	#define 		CMT2310A_CTL_REG_12         	0x0C					// auto frequencry hopping channel space	
		#define		CMT2310A_FREQ_SPACE_REG			0x0C					
			                                    	
	#define 		CMT2310A_CTL_REG_13         	0x0D					// auto frequencry hopping times
		#define		CMT2310A_FREQ_TIMES_REG			0x0D					// range 1-64(n+1)	
                                                	
	#define 		CMT2310A_CTL_REG_14         	0x0E					// fifo status interrupt control register 
		#define		CMT2310A_RX_FIFO_FULL_EN		(1<<7)					// 0=disable,  1=enable rx fifo full interrupt
		#define		CMT2310A_RX_FIFO_NMTY_EN		(1<<6)					// 0=disable,  1=enable rx fifo non-empty interrupt
		#define		CMT2310A_RX_FIFO_TH_EN			(1<<5)					// 0=disable,  1=enable rx fifo threshold interrupt
		#define		CMT2310A_RX_FIFO_OVF_EN			(1<<3)					// 0=disable,  1=enable rx fifo overflow interrupt
		#define		CMT2310A_TX_FIFO_FULL_EN		(1<<2)					// 0=disable,  1=enable tx fifo full interrupt
		#define		CMT2310A_TX_FIFO_NMTY_EN		(1<<1)					// 0=disable,  1=enable tx fifo non-empty interrupt
		#define		CMT2310A_TX_FIFO_TH_EN			(1<<0)					// 0=disable,  1=enable tx fifo threshold interrupt
		                                        	
	#define 		CMT2310A_CTL_REG_15         	0x0F					// antenna diversity indicate
		#define		CMT2310A_ANT_INSTR				(1<<0)					// indicate antenna diversity lock which antenna
                                                	

	#define 		CMT2310A_CTL_REG_16         	0x10					// interrupt1 selection
		#define		CMT2310A_INT1_SEL_REG			0x10
		#define		CMT2310A_INT1_SEL_MASK			0x3F

	#define 		CMT2310A_CTL_REG_17             0x11					// interrupt2 selection	
		#define		CMT2310A_INT2_SEL_REG			0x11
		#define		CMT2310A_INT1_POLAR				(1<<7)					// int1 polar selection, 0=high acitve,  1=low acitve;
		#define		CMT2310A_INT2_POLAR				(1<<6)					// int1 polar selection, 0=high acitve,  1=low acitve;
		#define		CMT2310A_INT2_SEL_MASK			0x3F

		#define		CMT2310A_INT_MIX				(0<<0)					// all interrupt mixed together
		#define		CMT2310A_INT_ANT_LOCK			(1<<0)					// antenna locked
		#define		CMT2310A_INT_RSSI_PJD_VALID		(2<<0)					// rssi and/or pjd valid
		#define		CMT2310A_INT_PREAM_PASS			(3<<0)					// preamble detected
		#define		CMT2310A_INT_SYNC_PASS			(4<<0)					// sync word detected
		#define		CMT2310A_INT_ADDR_PASS			(5<<0)					// node address detected
		#define		CMT2310A_INT_CRC_PASS			(6<<0)					// crc ok detected 
		#define		CMT2310A_INT_PKT_OK				(7<<0)					// packet received detected
		#define		CMT2310A_INT_PKT_DONE			(8<<0)					// packet received detected, even wrong packet or collision
		#define		CMT2310A_INT_SLEEP_TMO			(9<<0)					// sleep timer time-out
		#define		CMT2310A_INT_RX_TMO				(10<<0)					// rx timer time-out
		#define		CMT2310A_INT_RX_FIFO_NMTY		(11<<0)					// rx fifo non-empty
		#define		CMT2310A_INT_RX_FIFO_TH			(12<<0)					// rx fifo threshold
		#define		CMT2310A_INT_RX_FIFO_FULL		(13<<0)					// rx fifo full
		#define		CMT2310A_INT_RX_FIFO_WBYTE		(14<<0)					// rx fifo write byte trigger
		#define		CMT2310A_INT_RX_FIFO_OVF		(15<<0)					// rx fifo overflow
		#define		CMT2310A_INT_TX_DONE			(16<<0)					// tx done
		#define		CMT2310A_INT_TX_FIFO_NMTY		(17<<0)					// tx fifo non-empty
		#define		CMT2310A_INT_TX_FIFO_TH			(18<<0)					// tx fifo threshold
		#define		CMT2310A_INT_TX_FIFO_FULL		(19<<0)					// tx fifo full
		#define		CMT2310A_INT_STATE_IS_READY		(20<<0)					// state is ready
		#define		CMT2310A_INT_STATE_IS_FS		(21<<0)					// state is FS
		#define		CMT2310A_INT_STATE_IS_RX		(22<<0)					// state is rx
		#define		CMT2310A_INT_STATE_IS_TX		(23<<0)					// state is tx
		#define		CMT2310A_INT_LBD_STATUS			(24<<0)					// LBD status
		#define		CMT2310A_INT_API_CMD_FAILED		(25<<0)					// API Command failed
		#define		CMT2310A_INT_API_DONE			(26<<0)					// API execute finish
		#define		CMT2310A_INT_TX_DC_DONE			(27<<0)					// ??
		#define		CMT2310A_INT_ACK_RECV_FAILED	(28<<0)					// ack recieve failed
		#define		CMT2310A_INT_TX_RESEND_DONE		(29<<0)					// tx re-send done
		#define		CMT2310A_INT_NACK_RECV			(30<<0)					// non-ack received
		#define		CMT2310A_INT_SEQ_MATCH			(31<<0)					// sequence number match
		#define		CMT2310A_INT_CSMA_DONE			(32<<0)					// CSMA done
		#define		CMT2310A_INT_CCA_STATUS			(33<<0)					// CCA status match
		

	#define 		CMT2310A_CTL_REG_18             0x12					// interrupt enable control 1
		#define		CMT2310A_INT_CTL1_REG			0x12			
		#define		CMT2310A_SLEEP_TMO_EN			(1<<7)					// 0=disable, 1=enable sleep timer time-out
		#define		CMT2310A_RX_TMO_EN				(1<<6)					// 0=disable, 1=enable rx timer time-out
		#define		CMT2310A_TX_DONE_EN				(1<<5)					// 0=disable, 1=enable tx done 
		#define		CMT2310A_PREAM_PASS_EN			(1<<4)					// 0=disable, 1=enable preamble detect
		#define		CMT2310A_SYNC_PASS_EN			(1<<3)					// 0=disable, 1=enable syncword detect
		#define		CMT2310A_ADDR_PASS_EN			(1<<2)					// 0=disable, 1=enable node address detect
		#define		CMT2310A_CRC_PASS_EN			(1<<1)					// 0=disable, 1=enable packet crc detect
		#define		CMT2310A_PKT_DONE_EN			(1<<0)					// 0=disable, 1=enable packet received done

	#define 		CMT2310A_CTL_REG_19             0x13					// interrupt enable control 2
		#define		CMT2310A_INT3_POLAR				(1<<7)					// int1 polar selection, 0=high acitve,  1=low acitve;		
		#define		CMT2310A_PD_FIFO				(1<<6)					// 0=retain fifo in sleep,   1=not retain fifo in sleep
		#define		CMT2310A_FIFO_TH_BIT8			(1<<5)					// fifo threshold bit8
		#define		CMT2310A_FIFO_AUTO_CLR_RX_EN	(1<<4)					// 0=not clear fifo,  1=clear fifo, when trigger go to rx
		#define		CMT2310A_FIFO_AUTO_RES_TX_EN	(1<<3)					// 0=auto restore tx fifo,    1=don't auto restore tx fifo, when tx done. (if TX_PKT_NUM is not 0, should be set this bit) 
		#define		CMT2310A_FIFO_TX_TEST_EN		(1<<2)					// 0=tx fifo only write,      1=tx fifo can be read.  suggest only for testing, normal useage should be clear this bit
		#define		CMT2310A_FIFO_MERGE_EN			(1<<1)					// 0=split fifo to tx and rx, 1=fifo merge together 
		#define		CMT2310A_FIFO_TX_RX_SEL			(1<<0)					// 0=fifo for tx useage, 	  1=fifo for rx useage, when CMT2310A_FIFO_MERGE_EN=1

	#define 		CMT2310A_CTL_REG_20             0x14					// fifo threshold value
		#define		CMT2310A_FIFO_TH_REG			0x14
	
	#define 		CMT2310A_CTL_REG_21             0x15					// interrupt enable control 3 
		#define		CMT2310A_RSSI_PJD_VALID_EN		(1<<6)					// 0=disable, 1=enable RSSI and/or PJD valid interrupt
		#define		CMT2310A_OP_CMD_FAILED_EN		(1<<5)					// 0=disable, 1=enable API Command failed interrupt		
		#define		CMT2310A_RSSI_COLL_EN			(1<<4)					// 0=disable, 1=enable signal collision interrupt
		#define		CMT2310A_PKT_ERR_EN				(1<<3)					// 0=disable, 1=enable packet recieve error interrupt
		#define		CMT2310A_LBD_STATUS_EN			(1<<2)					// 0=disable, 1=enable LBD status interrupt
		#define		CMT2310A_LBD_STOP_EN			(1<<1)					// 0=disable, 1=enable LBD stop interrupt
		#define		CMT2310A_LD_STOP_EN				(1<<0)					// 0=disable, 1=enable PLL lock detect interrupt

	#define 		CMT2310A_CTL_REG_22             0x16					// function enable config 0		
		#define		CMT2310A_FREQ_HOP_MANU_EN		(1<<7)					// 0=disable, 1=enable manual frequencry hopping
		#define		CMT2310A_RX_HOP_PERSIST			(1<<6)					// 0=finish,  1=on going, Rx auto frequencry hopping
		#define		CMT2310A_FREQ_SW_STATE			(1<<5)					// 0=return to READY,  1=return to RFS,  for Rx auto frequencry hopping mode, every times after RX time-out state
		#define		CMT2310A_TX_DATA_INV			(1<<4)					// 0=don't invert,     1=invert, for TX data input from GPIO
		#define		CMT2310A_PA_DIFF_SEL			(1<<3)					// 0=single-end PA,    1=differential-end PA,  for CMT2310A need select single-end PA
		#define		CMT2310A_TRX_SWT_INV			(1<<2)					// 0=don't invert,     1=invert for TX/RX antenna switch
		#define		CMT2310A_TRX_SWT_EN				(1<<1)					// 0=disable, 1=enable TX/RX antenna switch
		#define		CMT2310A_ANT_LOCK_EN			(1<<0)					// 0=disable, 1=enable antenna diversity lock interrupt

	#define 		CMT2310A_CTL_REG_23             0x17					// interrupt enable control 4		
		#define		CMT2310A_API_DONE_EN			(1<<7)					// 0=disable, 1=enable API done interrupt
		#define		CMT2310A_CCA_STATUS_EN			(1<<6)					// 0=disable, 1=enable CCA status interrupt
		#define		CMT2310A_CSMA_DONE_EN			(1<<5)					// 0=disable, 1=enable CSMA done interrupt
		#define		CMT2310A_TX_DC_DONE_EN			(1<<4)					// 0=disable, 1=enable TX DutyCycle done interrupt
		#define		CMT2310A_ACK_RECV_FAILED_EN		(1<<3)					// 0=disable, 1=enable ACK received failed interrupt
		#define		CMT2310A_TX_RESEND_DONE_EN		(1<<2)					// 0=disable, 1=enable TX re-send done interrupt
		#define		CMT2310A_NACK_RECV_EN			(1<<1)					// 0=disable, 1=enable no ACK received interrupt
		#define		CMT2310A_SEQ_MATCH_EN			(1<<0)					// 0=disable, 1=enable sequence number match interrupt
	
