timothy9079/solt_epd60/Projects/STM32WB5MM-DK/Applications/BLE/BLE_HeartRate/STM32CubeIDE/Device/Rf/inc/CMT2310A_reg.h
	#define 		CMT2310A_CTL_REG_24             0x18					// interrupt flag & clear control 1
		#define		CMT2310A_SLEEP_TMO_FLG			(1<<5)					// sleep timer time-out flag
		#define		CMT2310A_RX_TMO_FLG				(1<<4)					// rx timer time-out flag
		#define		CMT2310A_TX_DONE_FLG			(1<<3)					// tx done flag
		#define		CMT2310A_SLEEP_TMO_CLR			(1<<2)					// set '1' to clear Sleep timer time-out flag 
		#define		CMT2310A_RX_TMO_CLR				(1<<1)					// set '1' to clear Rx timer time-out flag
		#define		CMT2310A_TX_DONE_CLR			(1<<0)					// set '1' to clear TX done flag
	
	#define 		CMT2310A_CTL_REG_25             0x19					// interrupt flag & clear control 2
		#define		CMT2310A_PREAM_PASS_CLR			(1<<4)					// set '1' to clear PREAM_PASS flag
		#define		CMT2310A_SYNC_PASS_CLR			(1<<3)					// set '1' to clear SYNC_PASS flag
		#define		CMT2310A_ADDR_PASS_CLR			(1<<2)					// set '1' to clear ADDR_PASS flag
		#define		CMT2310A_CRC_PASS_CLR			(1<<1)					// set '1' to clear CRC_PASS flag
		#define		CMT2310A_PKT_DONE_CLR			(1<<0)					// set '1' to clear PKT_DONE flag
		
	#define 		CMT2310A_CTL_REG_26             0x1A					// interrupt flag & clear control 3	(-RO)
		#define		CMT2310A_SYNC1_PASS_FLG			(1<<5)					// sync-word1 match interrupt flag
		#define		CMT2310A_PREAM_PASS_FLG			(1<<4)					// preamlbe pass interrupt flag
		#define		CMT2310A_SYNC_PASS_FLG			(1<<3)					// sync-word match interrupt flag
		#define		CMT2310A_ADDR_PASS_FLG			(1<<2)					// node address match interrupt flag
		#define		CMT2310A_CRC_PASS_FLG			(1<<1)					// packet crc pass interrupt flag
		#define		CMT2310A_PKT_DONE_FLG			(1<<0)					// packet done interrupt flag	

	#define 		CMT2310A_CTL_REG_27             0x1B					// fifo control 1, fifo clear
		#define		CMT2310A_TX_FIFO_RESTORE		(1<<2)					// 0=disable, 1=enable 
		#define		CMT2310A_RX_FIFO_CLR			(1<<1)					// set '1' to clear Rx FIFO
		#define		CMT2310A_TX_FIFO_CLR			(1<<0)					// set '1' to clear Tx FIFO
			
	#define 		CMT2310A_CTL_REG_28             0x1C					// fifo control 2, fifo flag		(-RO)
		#define		CMT2310A_RX_FIFO_FULL_FLG		(1<<7)					// 
		#define		CMT2310A_RX_FIFO_NMTY_FLG		(1<<6)					//
		#define		CMT2310A_RX_FIFO_TH_FLG			(1<<5)					//
		#define		CMT2310A_RX_FIFO_OVF_FLG		(1<<3)					//
		#define		CMT2310A_TX_FIFO_FULL_FLG		(1<<2)					//
		#define		CMT2310A_TX_FIFO_NMTY_FLG		(1<<1)					//
		#define		CMT2310A_TX_FIFO_TH_FLG			(1<<0)					//
		
	#define 		CMT2310A_CTL_REG_29             0x1D					// auxrl function clear control			
		#define		CMT2310A_ANT_LOCK_CLR			(1<<4)					// set '1' to clear antenna lock
		#define		CMT2310A_OP_CMD_FAILED_CLR		(1<<3)					// set '1' to clear command operate failed 
		#define		CMT2310A_RSSI_COLL_CLR			(1<<2)					// set '1' to clear rssi collision
		#define		CMT2310A_PKT_ERR_CLR			(1<<1)					// set '1' to clear packet receive error
		#define		CMT2310A_LBD_STATUS_CLR			(1<<0)					// set '1' to clear LBD status

	#define 		CMT2310A_CTL_REG_30             0x1E					// auxrl function flag				(-RO)
		#define		CMT2310A_ANT_LOCK_FLG			(1<<4)					//
		#define		CMT2310A_OP_CMD_FAILED_FLG		(1<<3)					//
		#define		CMT2310A_RSSI_COLL_FLG			(1<<2)					//
		#define		CMT2310A_PKT_ERR_FLG			(1<<1)					//
		#define		CMT2310A_LBD_STATUS_FLG			(1<<0)					//

	#define 		CMT2310A_CTL_REG_31             0x1F					// mac function clear control
		#define		CMT2310A_API_DONE_CLR			(1<<7)					// set '1' to clear API done
		#define		CMT2310A_CCA_STATUS_CLR			(1<<6)					// set '1' to clear CCA status
		#define		CMT2310A_CSMA_DONE_CLR			(1<<5)					// set '1' to clear CSMA done
		#define		CMT2310A_TX_DC_DONE_CLR			(1<<4)					// set '1' to clear TX_DC_DONE
		#define		CMT2310A_ACK_RECV_FAILED_CLR	(1<<3)					// set '1' to clear ACK receive failed
		#define		CMT2310A_TX_RESEND_DONE_CLR		(1<<2)					// set '1' to clear Tx resend done
		#define		CMT2310A_NACK_RECV_CLR			(1<<1)					// set '1' to clear NACK receive 
		#define		CMT2310A_SEQ_MATCH_CLR			(1<<0)					// set '1' to clear sequence number match

	#define 		CMT2310A_CTL_REG_32             0x20					// mac function flag					(-RO)			
		#define		CMT2310A_API_DONE_FLG			(1<<7)					//		
		#define		CMT2310A_CCA_STATUS_FLG			(1<<6)					//
		#define		CMT2310A_CSMA_DONE_FLG		    (1<<5)					//
		#define		CMT2310A_TX_DC_DONE_FLG			(1<<4)					//
		#define		CMT2310A_ACK_RECV_FAILED_FLG	(1<<3)					//
		#define		CMT2310A_TX_RESEND_DONE_FLG		(1<<2)					//
		#define		CMT2310A_NACK_RECV_FLG			(1<<1)					//
		#define		CMT2310A_SEQ_MATCH_FLG			(1<<0)					//
	
	#define 		CMT2310A_CTL_REG_33             0x21					// RSSI value minimum	  				(-RO)
		#define		CMT2310A_RSSI_MIN_REG			0x21
	
	#define 		CMT2310A_CTL_REG_34             0x22					// RSSI value							(-RO)	
		#define		CMT2310A_RSSI_REG				0x22					

	#define 		CMT2310A_CTL_REG_35             0x23					// LBD value							(-RO)
		#define		CMT2310A_LBD_REG				0x23

	#define 		CMT2310A_CTL_REG_36             0x24					// temperature value					(-RO)
		#define		CMT2310A_TEMP_REG				0x24

	#define 		CMT2310A_CTL_REG_37             0x25					// frequence channel current active 	(-RO)
		#define		CMT2310A_FREQ_CHANL_ACT_REG		0x25
		
	#define 		CMT2310A_CTL_REG_38             0x26					// sequence number tx out[7:0]			(-RO)
	#define 		CMT2310A_CTL_REG_39             0x27					// sequence number tx out[15:8]			(-RO)
		#define		CMT2310A_SEQNUM_TX_OUT_L_REG	0x26
		#define		CMT2310A_SEQNUM_TX_OUT_H_REG	0x27
//--------------------------------- packet config -----------------------------
	#define 		CMT2310A_CTL_REG_40             0x28					// rx preamble size[4:0] + preamble length unit + data mode[1:0]
		#define		CMT2310A_RX_PREAM_SIZE_MASK		0xF8					// rx preamble detect length, 0=don't detect
		#define		CMT2310A_PREAM_LENG_UNIIT		(1<<2)					// 0=8bits/unit,  1=4bits/unit (nibble)
		
		#define		CMT2310A_DATA_MODE_MASK			(3<<0)
		#define		CMT2310A_DIRECT_MODE			(0<<0)					// Direct mode
		#define		CMT2310A_PACKET_MODE			(2<<0)					// Packet mode

	#define 		CMT2310A_CTL_REG_41             0x29					// tx preamble size[7:0]
	#define 		CMT2310A_CTL_REG_42             0x2A					// tx preamble size[15:8]
		#define		CMT2310A_TX_PREAM_SIZE_L_REG	0x29					// when TX_PREAM_SIZE=0, means do not send preamble
		#define		CMT2310A_TX_PREAM_SIZE_H_REG	0x2A
	
	#define 		CMT2310A_CTL_REG_43             0x2B					// preamble value
		#define		CMT2310A_PREAM_VALUE_REG		0x2B					// when PREAM_LENG_UNIIT = 0, 8bits active
																			// when PREAM_LENG_UNIIT = 1, 4bits(LSB) active
	#define 		CMT2310A_CTL_REG_44             0x2C					// sync control, sync_mode_sel + sync_tolerance[2:0] + sync_size[2:0] + sync_man_en
		#define		CMT2310A_SYNC_CTL_REG			0x2C
		#define		CMT2310A_SYNC_MODE_SEL			(1<<7)					// 0=compatible S2LP,   1=compatible 802.15.4
		#define		CMT2310A_SYNC_TOL_MASK			(7<<4)
		#define		CMT2310A_SYNC_SIZE_MASK			(7<<1)					// n+1 for SyncWord length
		#define		CMT2310A_SYNC_MAN_EN			(1<<0)					// 0=disable, 1=enable SyncWord manchester encoding
	
	#define 		CMT2310A_CTL_REG_45             0x2D					// sync value 0 [7:0]		send last
		#define		CMT2310A_SYNC_VALUE_7_REG		0x2D
	#define 		CMT2310A_CTL_REG_46             0x2E					// sync value 1 [15:8]
		#define		CMT2310A_SYNC_VALUE_6_REG		0x2E
	#define 		CMT2310A_CTL_REG_47             0x2F					// sync value 2 [23:16]
		#define		CMT2310A_SYNC_VALUE_5_REG		0x2F
	#define 		CMT2310A_CTL_REG_48             0x30					// sync value 3 [31:24]
		#define		CMT2310A_SYNC_VALUE_4_REG		0x30
	#define 		CMT2310A_CTL_REG_49             0x31					// sync value 4 [39:32]
		#define		CMT2310A_SYNC_VALUE_3_REG		0x31
	#define 		CMT2310A_CTL_REG_50             0x32					// sync value 5 [47:40]
		#define		CMT2310A_SYNC_VALUE_2_REG		0x32	
	#define 		CMT2310A_CTL_REG_51             0x33					// sync value 6 [55:48]
		#define		CMT2310A_SYNC_VALUE_1_REG		0x33
	#define 		CMT2310A_CTL_REG_52             0x34					// sync value 7 [63:56]  	send first
		#define		CMT2310A_SYNC_VALUE_0_REG		0x34	
	
	#define 		CMT2310A_CTL_REG_53             0x35					// sync fec value 0 [7:0]
		#define		CMT2310A_FEC_SYNC_7_REG			0x35
	#define 		CMT2310A_CTL_REG_54             0x36					// sync fec value 1 [15:8]
		#define		CMT2310A_FEC_SYNC_6_REG			0x36
	#define 		CMT2310A_CTL_REG_55             0x37					// sync fec value 2 [23:16]
		#define		CMT2310A_FEC_SYNC_5_REG			0x37
	#define 		CMT2310A_CTL_REG_56             0x38					// sync fec value 3 [31:24]
		#define		CMT2310A_FEC_SYNC_4_REG			0x38
	#define 		CMT2310A_CTL_REG_57             0x39					// sync fec value 4 [39:32]
		#define		CMT2310A_FEC_SYNC_3_REG			0x39
	#define 		CMT2310A_CTL_REG_58             0x3A					// sync fec value 5 [47:40]
		#define		CMT2310A_FEC_SYNC_2_REG			0x3A
	#define 		CMT2310A_CTL_REG_59             0x3B					// sync fec value 6 [55:48]
		#define		CMT2310A_FEC_SYNC_1_REG			0x3B
	#define 		CMT2310A_CTL_REG_60             0x3C					// sync fec	value 7 [63:56]
		#define		CMT2310A_FEC_SYNC_0_REG			0x3C	
	
	#define 		CMT2310A_CTL_REG_61             0x3D					// payload length [7:0]
	#define 		CMT2310A_CTL_REG_62             0x3E					// payload length [15:8]
		#define		CMT2310A_PAYLOAD_LENGTH_L_REG	0x3D
		#define		CMT2310A_PAYLOAD_LENGTH_H_REG	0x3E
	
	#define 		CMT2310A_CTL_REG_63             0x3F					// packet config 1,  interleave_en  +        x        +  length_size + piggybacking_en + x + addr_leng_conf + payload_bit_order + pkt_type
		#define		CMT2310A_INTERLEAVE_EN			(1<<7)					// 0=disable,  	1=enable interleave
		#define		CMT2310A_LENGTH_SIZE			(1<<5)					// 0=1Byte, for up to 255 bytes variable length packet£¬  
		 																	// 1=2Bytes, for up to 65535 bytes variable length packet
		#define		CMT2310A_PAGGYBACKING_EN		(1<<4)					// 0=disable,  	1=enable for auto paggy backing payload for auto-ack
		#define		CMT2310A_ADDR_FIELD_EN			(1<<3)					// 0=disable,   1=enable for node address field
		#define		CMT2310A_ADDR_LEN_CONF			(1<<2)					// 0=node address before length filed, 	1=node address after length filed.  Note! It is affect payload length
		#define		CMT2310A_PAYLOAD_BIT_ORDER		(1<<1)					// 0=MSB first, 1=LSB first for decode (payload+crc filed)
		#define		CMT2310A_PKT_TYPE				(1<<0)					// 0=fixed length packet,  	1=variable length packet

	#define 		CMT2310A_CTL_REG_64             0x40					// packet config 2,  sync_value_sel + addr_split_mode + addr_free_en +  addr_err_mask  +   addr_size[1:0]   + addr_det_mode[1:0]
		#define		CMT2310A_SYNC_VALUE_SEL			(1<<7)					// 0=select SYNC_VALUE,  	1=select SYNC_FEC_VALUE,  only for TX used
		#define		CMT2310A_ADDR_SPLIT_MODE		(1<<6)					// 0=only DEST_ADDR filed active, 	1=DEST_ADDR+SRC_ADDR filed both active  
		#define		CMT2310A_ADDR_FREE_EN			(1<<5)					// 0=disable,  	1=enable ADDR detect stand-alone
		#define		CMT2310A_ADDR_ERR_MASK			(1<<4)					// 0=allow, 	1=not allow for reset decoding when ADDR mis-matching
		#define		CMT2310A_ADDR_SIZE_MASK			(3<<2)					//
		
		#define		CMT2310A_ADDR_DET_MODE_MASK		(3<<0)					
		#define		CMT2310A_ADDR_DET_DISABLE		(0<<0)					// disable node address detect
		#define		CMT2310A_ADDR_DET_MATCH			(1<<0)					// rx only detect ADDR_VALUE,    tx send ADDR_VALUE
		#define		CMT2310A_ADDR_DET_BOARDCAST_0	(2<<0)					// rx detect ADDR_VALUE & all-0, tx send ADDR_VALUE
		#define		CMT2310A_ADDR_DET_BOARDCAST_ALL	(3<<0)					// rx detect ADDR_VALUE & all-0 & all-1,  tx send ADDR_VALUE
			

	#define 		CMT2310A_CTL_REG_65             0x41					// SRC_ADDR  [7:0]
	#define 		CMT2310A_CTL_REG_66             0x42					// SRC_ADDR  [15:8]
		#define		CMT2310A_SRC_ADDR_L_REG			0x41
		#define		CMT2310A_SRC_ADDR_H_REG			0x42
		
	#define 		CMT2310A_CTL_REG_67             0x43					// DEST_ADDR [7:0]
	#define 		CMT2310A_CTL_REG_68             0x44					// DEST_ADDR [15:8]
		#define		CMT2310A_DEST_ADDR_L_REG		0x43
		#define		CMT2310A_DEST_ADDR_H_REG		0x44

	#define 		CMT2310A_CTL_REG_69             0x45					// SRC_BITMASK [7:0]
	#define 		CMT2310A_CTL_REG_70             0x46					// SRC_BITMASK [15:8]
		#define		CMT2310A_SRC_BITMASK_L_REG		0x45
		#define		CMT2310A_SRC_BITMASK_H_REG		0x46
	
	#define 		CMT2310A_CTL_REG_71             0x47					// DEST_BITMASK [7:0]
	#define 		CMT2310A_CTL_REG_72             0x48					// DEST_BITMASK [15:8]
		#define		CMT2310A_DEST_BITMASK_L_REG		0x47
		#define		CMT2310A_DEST_BITMASK_H_REG		0x48
	
