timothy9079/solt_epd60/Projects/STM32WB5MM-DK/Applications/BLE/BLE_HeartRate/STM32CubeIDE/Device/Rf/inc/CMT2310A_reg.h
	#define 		CMT2310A_CTL_REG_73             0x49					// crc config,       crc_size[1:0]  +  crc_byte_swap   + crc_bit_inv  +   crc_range   +  crc_refin  +  crc_bit_order  +  crc_en 
		#define		CMT2310A_CRC_CFG_REG			0x49
		#define		CMT2310A_CRC_SIZE_MASK			(3<<6)
		#define		CMT2310A_CRC_SLE_CRC8			(0<<6)					// select crc-8
		#define		CMT2310A_CRC_SLE_CRC16			(1<<6)					// select crc-16
		#define		CMT2310A_CRC_SLE_CRC24			(2<<6)					// select crc-24
		#define		CMT2310A_CRC_SLE_CRC32			(3<<6)					// select crc-32
		
		#define		CMT2310A_CRC_BYTE_SWAP			(1<<5)					// crc16 for example, 0=[15:8]+[7:0],  1=[7:0]+[15:8],   
		#define		CMT2310A_CRC_BIT_INV			(1<<4)					// 0=disable,  		  1=enable for crc result inver	
		#define		CMT2310A_CRC_RANGE				(1<<3)					// 0=whole payload,   1=only data
		#define		CMT2310A_CRC_REFIN				(1<<2)					// 0=normal bit input flow,  1=inver bit input flow, for byte as unit
		#define		CMT2310A_CRC_BIT_ORDER			(1<<1)					// 0=MSB send first,  1=LSB send first
		#define		CMT2310A_CRC_EN					(1<<0)					// 0=disable, 		  1=enable CRC function
			
	#define 		CMT2310A_CTL_REG_74             0x4A					// crc seed 0 [7:0]
	#define 		CMT2310A_CTL_REG_75             0x4B					// crc seed 1 [15:8]
	#define 		CMT2310A_CTL_REG_76             0x4C					// crc seed 2 [23:16]
	#define 		CMT2310A_CTL_REG_77             0x4D					// crc seed 3 [31:24]
		#define		CMT2310A_CRC_SEED_0_REG			0x4A
		#define		CMT2310A_CRC_SEED_1_REG			0x4B
		#define		CMT2310A_CRC_SEED_2_REG			0x4C
		#define		CMT2310A_CRC_SEED_3_REG			0x4D

	#define 		CMT2310A_CTL_REG_78             0x4E					// crc polynomial 0 [7:0]
	#define 		CMT2310A_CTL_REG_79             0x4F					// crc polynomial 1 [15:8]
	#define 		CMT2310A_CTL_REG_80             0x50					// crc polynomial 2 [23:16]
	#define 		CMT2310A_CTL_REG_81             0x51					// crc polynomial 3 [31:24]
		#define		CMT2310A_CRC_POLY_0_REG			0x4E
		#define		CMT2310A_CRC_POLY_1_REG			0x4F
		#define		CMT2310A_CRC_POLY_2_REG			0x50
		#define		CMT2310A_CRC_POLY_3_REG			0x51

	#define 		CMT2310A_CTL_REG_82             0x52					// coding config,    crc_refout  +  whiten_seed[8]  +  whiten_seed_type  +  whiten_type[1:0]  +  whiten_en  +  manch_type  + manch_en
		#define		CMT2310A_CRC_REFOUT				(1<<7)					// 0=MSB->LSB,  1=LSB->MSB, crc result turn over, byte as unit
		#define		CMT2310A_WHITEN_SEED_B8			(1<<6)					// whiten_seed[8]
		#define		CMT2310A_WHITEN_SEED_TYPE		(1<<5)					// 0=compatible A7139 PN7 seed,  1=PN7 seed by whien_seed
		
		#define		CMT2310A_WHITEN_TYPE_MASK		(3<<3)
		#define		CMT2310A_WHITEN_PN9_CCITT		(0<<3)					// whiten type select PN9 CCITT
		#define		CMT2310A_WHITEN_PN9_IBM			(1<<3)					// whiten type select PN9 IBM
		#define		CMT2310A_WHITEN_PN7				(2<<3)					// whiten type select PN7
		
		#define		CMT2310A_WHITEN_EN				(1<<2)					// 0=disable, 1=enable whien encoding/decoding
		
		#define		CMT2310A_MANCH_TYPE				(1<<1)					// 0= 2'b01 as logic'1', 2'b10 as logic'0'
																			// 1= 2'b10 as logic'1', 2'b01 as logic'0'	
																			
		#define		CMT2310A_MANCH_EN				(1<<0)					// 0=disable, 1=enable	manchester encoding/decoding

	#define 		CMT2310A_CTL_REG_83             0x53					// whiten seed [7:0]
		#define		CMT2310A_WHITEN_SEED_REG		0x53
	
	#define 		CMT2310A_CTL_REG_84             0x54					// packet config 3,  crc_err_clr_fifo_en + fcs2_en  +  seqnum_match_en  +  seqnum_size  +  seqnum_auto_inc  +  seqnum_en  +  tx_prefix_type[1:0]
		#define		CMT2310A_CRCERR_CLR_FIFO_EN		(1<<7)					// 0=not clear,  1=clear Rx FIFO, when receive packet with CRC mis-matching
		#define		CMT2310A_FCS2_EN				(1<<6)					// 0=disable,    1=enable FCS2 filed
		#define		CMT2310A_SEQNUM_MATCH_EN		(1<<5)					// 0=disable,    1=enable matching for TX_ACK used, receive ack packet matching seqnum number which sent by local
		#define		CMT2310A_SEQNUM_SIZE			(1<<4)					// 0=1Byte,      1=2Byte for sequence number filed
		#define		CMT2310A_SEQNUM_AUTO_INC		(1<<3)					// 0=disable, 	 1=enable sequence number auto increase in TX, step=1
		#define		CMT2310A_SEQNUM_EN				(1<<2)					// 0=disable,    1=enable sequence number filed (FCS1)

		#define		CMT2310A_TX_PREFIX_TYPE_MASK	(3<<0)
		#define		CMT2310A_TX_PREFIX_IS_0			(0<<0)					// tx prefix = 0
		#define		CMT2310A_TX_PREFIX_IS_1			(1<<0)					// tx prefix = 1
		#define		CMT2310A_TX_PREFIX_IS_PREAM		(2<<0)					// tx prefix = preamble



	#define	 		CMT2310A_CTL_REG_85             0x55					// tx packet number [7:0]
	#define 		CMT2310A_CTL_REG_86             0x56					// tx packet number [15:8]			
		#define		CMT2310A_TX_PKT_NUM_L_REG		0x55
		#define		CMT2310A_TX_PKT_NUM_H_REG		0x56	
	
	#define 		CMT2310A_CTL_REG_87             0x57					// sequence number tx inital value [7:0]
	#define 		CMT2310A_CTL_REG_88             0x58					// sequence number tx inital value [15:8]
		#define		CMT2310A_SEQNUM_TX_IN_L_REG		0x57
		#define		CMT2310A_SEQNUM_TX_IN_H_REG		0x58	
	
	#define 		CMT2310A_CTL_REG_89             0x59					// tx packet gap [7:0]
		#define		CMT2310A_TX_PKT_GAP_REG			0x59

	#define 		CMT2310A_CTL_REG_90             0x5A					// Rssi calibrate offset
		#define		CMT2310A_RSSI_CAL_OFFSET_REG	0x5A
		
	#define 		CMT2310A_CTL_REG_91             0x5B					// tx side FCS2 filed inital value [7:0]
		#define		CMT2310A_FCS2_TX_IN_REG			0x5B				
	
	#define 		CMT2310A_CTL_REG_92             0x5C					// rx side FCC2 filed receive value [7:0]					(-RO)
		#define		CMT2310A_FCS2_RX_OUT_REG		0x5C
	
	#define 		CMT2310A_CTL_REG_93             0x5D					// fec config 1, FEC_TICC  +  fec_padding_code[12:8]  +  fec_rcs_nrnsc_sel  + fec_en 
		#define		CMT2310A_FEC_TICC				(1<<7)					// 0=invert, 	1=not invert, for FEC ui
		#define 	CMT2310A_FEC_PAD_CODE_H_MASK	(0x1F<<2)				// fec_padding_code[12:8]
		#define		CMT2310A_FEC_RSC_NRNSC_SEL		(1<<1)					// 0=RSC mode,  1=NRNSC mode
		#define		CMT2310A_FEC_EN					(1<<0)					// 0=disable,   1=enable FEC encoding/decoding

	#define 		CMT2310A_CTL_REG_94             0x5E					// fec config 2,   fec_padding_code[7:0]
		#define		CMT2310A_FEC_PAD_CODE_L_REG		0x5E
	
	#define 		CMT2310A_CTL_REG_95             0x5F					// 4-FSK config,   4fsk_3_level[1:0]  +  4fsk_2_level[1:0]  +  4fsk_1_level[1:0]  +  4fsk_0_level[1:0]
		#define		CMT2310A_MAP_4FSK_LEVEL_REG		0x5F
//--------------------------------- system control config --------------------------------
	#define 		CMT2310A_CTL_REG_96             0x60					// sysctrl 1,      fw_nk_sel  +  tx_exit_state[2:0]  +      x      +  tx_ack_en  +  tx_dc_persist_en  +  tx_dc_en

		#define		CMT2310A_TX_EXIT_STATE_MASK		(7<<4)					// tx done exit state masker
		#define		CMT2310A_TX_EXIT_TO_SLEEP		(1<<4)					// tx done exit to sleep
		#define		CMT2310A_TX_EXIT_TO_READY		(2<<4)					// tx done exit to ready
		#define		CMT2310A_TX_EXIT_TO_TFS			(3<<4)					// tx done exit to TFS
		#define		CMT2310A_TX_EXIT_TO_TX			(4<<4)					// tx done exit to TX 
		#define		CMT2310A_TX_EXIT_TO_RFS			(5<<4)					// tx done exit to RFS
		#define		CMT2310A_TX_EXIT_TO_RX			(6<<4)					// tx done exit to RX 
																			// others to sleep, & only for packet mode tx done
		#define		CMT2310A_TX_AUTO_HOP_EN			(1<<3)					// 0=disable, 	1=enable tx auto hopping
		#define		CMT2310A_TX_ACK_EN				(1<<2)					// 0=disable, 	1=enable tx ack function
		#define		CMT2310A_TX_DC_PERSIST_EN		(1<<1)					// 0=auto exit tx duty-cycle when reach TX_DC_TIMES,  1=hold on until set this bit to '0'
		#define		CMT2310A_TX_DC_EN				(1<<0)					// 0=disable,  	1=enable tx duty-cycle function

	#define 		CMT2310A_CTL_REG_97             0x61					// sysctrl 2,      csma_en    +  rx_exit_state[2:0]  + timer_rx_en +  rx_ack_en  +   rx_auto_hop_en   +  rx_dc_en
		#define		CMT2310A_CSMA_EN				(1<<7)					// 0=disable, 	1=enable CSMA

		#define		CMT2310A_RX_EXIT_STATE_MASK		(7<<4)					// rx done exit state masker
		#define		CMT2310A_RX_EXIT_TO_SLEEP		(1<<4)					// rx done exit to sleep
		#define		CMT2310A_RX_EXIT_TO_READY		(2<<4)					// rx done exit to ready
		#define		CMT2310A_RX_EXIT_TO_TFS			(3<<4)					// rx done exit to TFS
		#define		CMT2310A_RX_EXIT_TO_TX			(4<<4)					// rx done exit to TX 
		#define		CMT2310A_RX_EXIT_TO_RFS			(5<<4)					// rx done exit to RFS
		#define		CMT2310A_RX_EXIT_TO_RX			(6<<4)					// rx done exit to RX 
																			// others to sleep, & only for packet mode rx done
		#define		CMT2310A_RX_TIMER_EN			(1<<3)					// 0=disable, 	1=enable rx timer
		#define		CMT2310A_RX_ACK_EN				(1<<2)					// 0=disable, 	1=enable rx ack function
		#define		CMT2310A_RX_AUTO_HOP_EN			(1<<1)					// 0=disable,   1=enable rx auto hopping function
		#define		CMT2310A_RX_DC_EN				(1<<0)					// 0=disable, 	1=enable rx duty-cycle function

