timothy9079/solt_epd60/Projects/STM32WB5MM-DK/Applications/BLE/BLE_HeartRate/STM32CubeIDE/Device/Rf/inc/CMT2310A_reg.h
	#define 		CMT2310A_CTL_REG_98             0x62					// sysctrl 3,      pkt_done_exit_en  +  rx_hop_slp_mode[2:0]  +  slp_mode[3:0]
		#define		CMT2310A_PKT_DONE_EXIT_EN		(1<<7)					// 0=keep current, 	1=depends on RX_EXIT_STATE
		#define		CMT2310A_RX_HOP_SLP_MODE_MASK	(7<<4)					// rx hopping supper low power mode selection
		#define		CMT2310A_SLP_MODE_MASK			(15<<0)					// rx supper low power mode selection
	
	#define 		CMT2310A_CTL_REG_99             0x63                    // sysctrl 4,      timer_m_sleep [7:0]
	#define 		CMT2310A_CTL_REG_100            0x64					// sysctrl 5, 	   timer_m_sleep [10:8]  +  timer_r_sleep [4:0]
		#define		CMT2310A_SLEEP_TIMER_M_REG		0x63					// Tsleep = M*2^(R+1)*31.25us, R from 0 to 26
		#define		CMT2310A_SLEEP_TIMER_R_REG		0x64					
		#define		CMT2310A_SLEEP_TIMER_M_H_MASK	(7<<5)					
		
	#define 		CMT2310A_CTL_REG_101            0x65					// sysctrl 6,      timer_m_rx_T1 [7:0] 
	#define 		CMT2310A_CTL_REG_102            0x66					// sysctrl 7,      timer_m_rx_T1 [10:8]  +  timer_r_rx_T1 [4:0]
		#define		CMT2310A_RX_TIMER_T1_M_REG		0x65					// Trx_t1 = M*2^(R+1)*20us, R from 0 to 21, 
		#define		CMT2310A_RX_TIMER_T1_R_REG		0x66					
		#define		CMT2310A_RX_TIMER_T1_M_H_MASK	(7<<5)

	#define 		CMT2310A_CTL_REG_103            0x67					// sysctrl 8, 	   timer_m_rx_T2 [7:0] 	
	#define 		CMT2310A_CTL_REG_104            0x68					// sysctrl 9,      timer_m_rx_T2 [10:8]  +  timer_r_rx_T2 [4:0]
		#define		CMT2310A_RX_TIMER_T2_M_REG		0x67					// Trx_t1 = M*2^(R+1)*20us, R from 0 to 21, 
		#define		CMT2310A_RX_TIMER_T2_R_REG		0x68
		#define		CMT2310A_RX_TIMER_T2_M_H_MASK	(7<<5)

	#define 		CMT2310A_CTL_REG_105            0x69					// sysctrl 10,     tx_allow_rx  +  pup_done_state  +  timer_random_mode[1:0]  +  timer_sleep_en  +  rx_allow_tx  +  lfclk_sel  +  lfclk_out_en(lfosc/lfxo)

		#define		CMT2310A_TIMER_RAND_MODE_MASK	(3<<4)					// CSMA mode, CSMA sleep timer random selection:
		#define		CMT2310A_TIMER_RAND_R			(0<<4)					// select random R 
		#define		CMT2310A_TIMER_RAND_M 			(1<<4)					// select random M 
		#define		CMT2310A_TIMER_RAND_M_R			(2<<4)					// select random both R & M
		#define		CMT2310A_TIMER_RAND_OFF			(3<<4)					// select random off, used fixed value
	
		#define		CMT2310A_SLEEP_TIMER_EN			(1<<3)					// 0=disable, 	1=enable sleep timer
		#define		CMT2310A_LFCLK_SEL				(1<<1)					// 0=internal LFOSC,  	1=LFXO (32768Hz)
		#define		CMT2310A_LFCLK_OUT_EN			(1<<0)					// 0=disable, 	1=enable GPIO4 for LFCLK out, priority lower than DIG_CLKOUT_EN, but higher than GPIO4_SEL

	#define 		CMT2310A_CTL_REG_106            0x6A					// sysctrl 11,     cca_mode[2:0]  +  csma_persist_en  +  cca_int_sel[1:0]  +  cca_win_sel[1:0]
		#define		CMT2310A_CSMA_CCA_MODE_MASK		(7<<5)
		#define		CMT2310A_CSMA_CCA_DISABLE		(0<<5)					// 0= channel is always idle
		#define		CMT2310A_CSMA_CCA_RSSI			(1<<5)					// 1= active >=1 of 4 times detect window, by Rssi
		#define		CMT2310A_CSMA_CCA_PJD			(2<<5)					// 2= active >=1 of 4 times detect window, by PJD
		#define		CMT2310A_CSMA_CCA_RSSI_PJD		(3<<5)					// 3= active >=1 of 4 times detect window, by PJD or Rssi
		#define		CMT2310A_CSMA_CCA_SYNC			(4<<5)					// 4= detected sync word
		#define		CMT2310A_CSMA_CCA_SYNC_RSSI		(5<<5)					// 5= detected sync word, or active >=1 of 4 times detect window, by Rssi
		#define		CMT2310A_CSMA_CCA_SYNC_PJD		(6<<5)					// 6= detected sync word, or active >=1 of 4 times detect window, by PJD
		#define		CMT2310A_CSMA_CCA_SYNC_RSSI_PJD	(7<<5)					// 7= detected sync word, or active >=1 of 4 times detect window, by PJD or Rssi
		
		#define		CMT2310A_CSMA_PERSIST_EN		(1<<4)					// 0=auto exit when reach max & channel still busy, 	1=keep on work until send out  
		
		#define		CMT2310A_CCA_INT_SEL_MASK		(3<<2)
		#define		CMT2310A_CCA_INT_BY_PJD			(0<<2)					// CSMA_CCA interrupt condition by PJD
		#define		CMT2310A_CCA_INT_BY_RSSI		(1<<2)					// CSMA_CCA interrupt condition by RSSI
		#define		CMT2310A_CCA_INT_BY_PJD_RSSI	(2<<2)					// CSMA_CCA interrupt condition by PJD & RSSI
		
		#define		CMT2310A_CCA_WIN_SEL_MASK		(3<<0)
		#define		CMT2310A_CCA_WIN_32_SYMBOL		(0<<0)					// CSMA detect window select 32symbols
		#define		CMT2310A_CCA_WIN_64_SYMBOL		(1<<0)					// CSMA detect window select 64symbols
		#define		CMT2310A_CCA_WIN_128_SYMBOL		(2<<0)					// CSMA detect window select 128symbols
		#define		CMT2310A_CCA_WIN_256_SYMBOL		(3<<0)					// CSMA detect window select 256symbols
	
	
	#define 		CMT2310A_CTL_REG_107            0x6B					// sysctrl 12, 	   timer_m_rx_csma [7:0]
	#define 		CMT2310A_CTL_REG_108            0x6C					// sysctrl 13,     timer_m_rx_csma [10:8]  +  timer_r_rx_csma [4:0]
		#define		CMT2310A_RX_TIMER_CSMA_M_REG	0x6B					// Trx_csma = M*2^(R+1)*20us, R from 0 to 21, 
		#define		CMT2310A_RX_TIMER_CSMA_R_REG	0x6C
		#define		CMT2310A_RX_TIMER_CSMA_M_H_MASK	(15<<4)		
		
	#define 		CMT2310A_CTL_REG_109            0x6D					// low battery detect threshold, lbd_th[7:0]
		#define		CMT2310A_LBD_TH_REG				0x6D

	#define 		CMT2310A_CTL_REG_110            0x6E					// sysctrl 14,     tx_dc_timer [7:0]
		#define		CMT2310A_TX_DC_TIMES_REG		0x6E					

	#define 		CMT2310A_CTL_REG_111            0x6F					// 
		#define		CMT2310A_LENGTH_MODE			(1<<7)					// 0=normal, length filed as payload length,  	1=as Wi-SUN mode
		#define		CMT2310A_WISUN_ALLIN			(1<<6)
		#define		CMT2310A_WHITEN_WISUN			(1<<5)
		#define		CMT2310A_WISUN_MS				(1<<4)
		#define		CMT2310A_WISUN_FCS				(1<<1)
		#define		CMT2310A_WISUN_DW				(1<<0)
	
	#define 		CMT2310A_CTL_REG_112            0x70					// sysctrl 15,     tx_dc_done_timer [7:0]		(-RO)	
		#define		CMT2310A_TX_DC_DONE_TIMES_REG	0x70
		
	#define 		CMT2310A_CTL_REG_113            0x71					// sysctrl 16,     tx_resend_timer [7:0]
		#define		CMT2310A_TX_RS_TIMES_REG		0x71

	#define 		CMT2310A_CTL_REG_114            0x72					// sysctrl 17,     tx_resend_done_timer [7:0]	(-RO)
		#define		CMT2310A_TX_RS_DONE_TIMES_REG	0x72

	#define 		CMT2310A_CTL_REG_115            0x73					// sysctrl 18,     csma_timer [7:0]
		#define		CMT2310A_CSMA_TIMES_REG			0x73
		
	#define 		CMT2310A_CTL_REG_116            0x74					// sysctrl 19,     csma_done_timer [7:0]		(-RO)
		#define		CMT2310A_CSMA_DONE_TIMES_REG	0x74

	#define 		CMT2310A_CTL_REG_117            0x75					

	#define 		CMT2310A_CTL_REG_118            0x76					// sysctrl 20, 	   timer_m_sleep_csma [7:0]
	#define 		CMT2310A_CTL_REG_119            0x77					// sysctrl 21, 	   timer_m_sleep_csma [10:8]  +  timer_r_sleep_csma [4:0]
		#define		CMT2310A_SLEEP_TIMER_CSMA_M_REG	0x76					// Tsleep_timer_csma = M*2^(R+1)*31.25us, R from 0 to 26,
		#define		CMT2310A_SLEEP_TIMER_CSMA_R_REG	0x77

