timothy9079/solt_epd60/Projects/STM32WB5MM-DK/Applications/BLE/BLE_HeartRate/STM32CubeIDE/Device/Rf/inc/CMT2310A_reg.h
	#define			CMT2310A_FIFO_RW_PORT_REG		0x7A					// FIFO R/W interface
	#define			CMT2310A_FIFO_RW_PORT			0x7A
	
	#define			CMT2310A_CRW_PORT_REG			0x7B	
	#define			CMT2310A_CRW_PORT				0x7B

	#define			CMT2310A_CLT_REG_126			0x7E
	#define 		CMT2310A_PAGE_CTL_REG	        0x7E					// hv_page_sel
		#define		CMT2310A_PAGE_SEL_MASK			(3<<6)
		#define		CMT2310A_PAGE_0					(0<<6)					// 0=page 0
		#define		CMT2310A_PAGE_1					(1<<6)					// 1=page 1
		#define		CMT2310A_PAGE_2					(2<<6)					// 2=page 2

	#define 		CMT2310A_SOFT_RST               0x7F					// soft_reset


// --------------------------- CUS PAGE1 defines -----------------------------------------
	#define 		CMT2310A_CMT_REG_00             0x00              		// export by RFPDK
	#define 		CMT2310A_CMT_REG_01             0x01                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_02             0x02                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_03             0x03                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_04             0x04                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_05             0x05                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_06             0x06                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_07             0x07                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_08             0x08                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_09             0x09                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_10             0x0A                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_11             0x0B                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_12             0x0C                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_13             0x0D                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_14             0x0E                    // export by RFPDK
	#define 		CMT2310A_CMT_REG_15             0x0F                    // export by RFPDK
	#define 		CMT2310A_TX_FREQ_REG_00         0x10                    // export by RFPDK
	#define 		CMT2310A_TX_FREQ_REG_01         0x11                    // export by RFPDK
	#define 		CMT2310A_TX_FREQ_REG_02         0x12                    // export by RFPDK
	#define 		CMT2310A_TX_FREQ_REG_03         0x13                    // export by RFPDK
	#define 		CMT2310A_TX_MODE_REG_00         0x14                    // export by RFPDK
	#define 		CMT2310A_TX_DR_REG_00           0x15                    // export by RFPDK
	#define 		CMT2310A_TX_DR_REG_01           0x16                    // export by RFPDK
	#define 		CMT2310A_TX_DR_REG_02           0x17                    // export by RFPDK
	#define 		CMT2310A_TX_DR_REG_03           0x18                    // export by RFPDK
	#define 		CMT2310A_TX_DR_REG_04           0x19                    // export by RFPDK
	#define 		CMT2310A_TX_DR_REG_05           0x1A                    // export by RFPDK
	#define 		CMT2310A_TX_DEV_REG_00          0x1B                    // export by RFPDK
	#define 		CMT2310A_TX_DEV_REG_01          0x1C                    // export by RFPDK
	#define 		CMT2310A_TX_DEV_REG_02          0x1D                    // export by RFPDK
	#define 		CMT2310A_TX_PWR_REG_00          0x1E                    // export by RFPDK
	#define 		CMT2310A_TX_PWR_REG_01          0x1F                    // export by RFPDK
	#define 		CMT2310A_TX_PWR_REG_02          0x20                    // export by RFPDK
	#define 		CMT2310A_TX_PWR_REG_03          0x21                    // export by RFPDK
	#define 		CMT2310A_TX_PWR_REG_04          0x22                    // export by RFPDK
	#define 		CMT2310A_TX_PWR_REG_05          0x23                    // export by RFPDK
	#define 		CMT2310A_TX_PWR_REG_06          0x24                    // export by RFPDK
	#define 		CMT2310A_TX_MISC_REG_00         0x25                    // export by RFPDK
	#define 		CMT2310A_TX_MISC_REG_01         0x26                    // export by RFPDK
	#define 		CMT2310A_TX_MISC_REG_02         0x27                    // export by RFPDK
	#define 		CMT2310A_TX_RESEV_00            0x28                    // export by RFPDK
	#define 		CMT2310A_TX_RESEV_01            0x29                    // export by RFPDK
	#define 		CMT2310A_TX_RESEV_02            0x2A                    // export by RFPDK
	#define 		CMT2310A_TX_RESEV_03            0x2B                    // export by RFPDK
	#define 		CMT2310A_TX_RESEV_04            0x2C                    // export by RFPDK
	#define 		CMT2310A_TX_RESEV_05            0x2D                    // export by RFPDK
	#define 		CMT2310A_TX_RESEV_06            0x2E                    // export by RFPDK
	#define 		CMT2310A_TX_RESEV_07            0x2F                    // export by RFPDK
	#define 		CMT2310A_RX_FREQ_REG_00         0x30                    // export by RFPDK
	#define 		CMT2310A_RX_FREQ_REG_01         0x31                    // export by RFPDK
	#define 		CMT2310A_RX_FREQ_REG_02         0x32                    // export by RFPDK
	#define 		CMT2310A_RX_FREQ_REG_03         0x33                    // export by RFPDK
	#define 		CMT2310A_RX_FREQ_REG_04         0x34                    // export by RFPDK
	#define 		CMT2310A_RX_IRF_REG_00          0x35                    // export by RFPDK
	#define 		CMT2310A_RX_IRF_REG_01          0x36                    // export by RFPDK
	#define 		CMT2310A_RX_IRF_REG_02          0x37                    // export by RFPDK
	#define 		CMT2310A_RX_IRF_REG_03          0x38                    // export by RFPDK
	#define 		CMT2310A_RX_PWR_REG_00          0x39                    // export by RFPDK
	#define 		CMT2310A_RX_PWR_REG_01          0x3A                    // export by RFPDK
	#define 		CMT2310A_RX_PWR_REG_02          0x3B                    // export by RFPDK
	#define 		CMT2310A_RX_DR_REG_00           0x3C                    // export by RFPDK
	#define 		CMT2310A_RX_DR_REG_01           0x3D                    // export by RFPDK
	#define 		CMT2310A_RX_DR_REG_02           0x3E                    // export by RFPDK
	#define 		CMT2310A_RX_DR_REG_03           0x3F                    // export by RFPDK
	#define 		CMT2310A_RX_DR_REG_04           0x40                    // export by RFPDK
	#define 		CMT2310A_RX_DR_REG_05           0x41                    // export by RFPDK
	#define 		CMT2310A_RX_DR_REG_06           0x42                    // export by RFPDK
	#define 		CMT2310A_RX_DR_REG_07           0x43                    // export by RFPDK
	#define 		CMT2310A_RX_CDR_REG_00          0x44                    // export by RFPDK
	#define 		CMT2310A_RX_CDR_REG_01          0x45                    // export by RFPDK
	#define 		CMT2310A_RX_CDR_REG_02          0x46                    // export by RFPDK
	#define 		CMT2310A_RX_CDR_REG_03          0x47                    // export by RFPDK
	#define 		CMT2310A_RX_CHNL_REG_00         0x48                    // export by RFPDK
	#define 		CMT2310A_RX_CHNL_REG_01         0x49                    // export by RFPDK
	#define 		CMT2310A_RX_CHNL_REG_02         0x4A                    // export by RFPDK
	#define 		CMT2310A_RX_AGC_REG_00          0x4B                    // export by RFPDK
	#define 		CMT2310A_RX_AGC_REG_01          0x4C                    // export by RFPDK
	#define 		CMT2310A_RX_AGC_REG_02          0x4D                    // export by RFPDK
	#define 		CMT2310A_RX_AGC_REG_03          0x4E                    // export by RFPDK
	#define 		CMT2310A_RX_AGC_REG_04          0x4F                    // export by RFPDK
	#define 		CMT2310A_RX_AGC_REG_05          0x50                    // export by RFPDK
	#define 		CMT2310A_RX_AGC_REG_06          0x51                    // export by RFPDK
	#define 		CMT2310A_RX_2FSK_REG_00         0x52                    // export by RFPDK
	#define 		CMT2310A_RX_2FSK_REG_01         0x53                    // export by RFPDK
	#define 		CMT2310A_RX_2FSK_REG_02         0x54                    // export by RFPDK
	#define 		CMT2310A_RX_2FSK_REG_03         0x55                    // export by RFPDK
	#define 		CMT2310A_RX_AFC_REG_00          0x56                    // export by RFPDK
	#define 		CMT2310A_RX_AFC_REG_01          0x57                    // export by RFPDK
	#define 		CMT2310A_RX_AFC_REG_02          0x58                    // export by RFPDK
	#define 		CMT2310A_RX_AFC_REG_03          0x59                    // export by RFPDK
	#define 		CMT2310A_RX_4FSK_REG_00         0x5A                    // export by RFPDK
	#define 		CMT2310A_RX_4FSK_REG_01         0x5B                    // export by RFPDK
	#define 		CMT2310A_RX_4FSK_REG_02         0x5C                    // export by RFPDK
	#define 		CMT2310A_RX_4FSK_REG_03         0x5D                    // export by RFPDK
	#define 		CMT2310A_RX_OOK_REG_00          0x5E                    // export by RFPDK
	#define 		CMT2310A_RX_OOK_REG_01          0x5F                    // export by RFPDK
	#define 		CMT2310A_RX_OOK_REG_02          0x60                    // export by RFPDK
	#define 		CMT2310A_RX_OOK_REG_03          0x61					// export by RFPDK	
		
	#define 		CMT2310A_RX_RSSI_REG_00         0x62					// rf_rssi_reg 0, 	coll_handle[1:0] + coll_step_sel[1:0] + rssi_update_sel[1:0] + nc + coll_det_en

		#define		CMT2310A_COLL_STEP_SEL_MASK		(3<<4)					
		#define		CMT2310A_COLL_STEP_SEL_6dB		(0<<4)					// collision select 6dB
		#define		CMT2310A_COLL_STEP_SEL_10dB		(1<<4)					// collision select 10dB
		#define		CMT2310A_COLL_STEP_SEL_16dB		(2<<4)					// collision select	16dB
		#define		CMT2310A_COLL_STEP_SEL_20dB		(3<<4)					// collision select	20dB
	
		#define		CMT2310A_RSSI_UPDATE_SEL_MASK	(3<<2)
		#define		CMT2310A_RSSI_UPDATE_ALWAYS		(0<<2)					// rssi update always on
		#define		CMT2310A_RSSI_UPDATE_PREAM_OK	(1<<2)					// rssi	update by preamble detected		
		#define		CMT2310A_RSSI_UPDATE_SYNC_OK	(2<<2)					// rssi update by syncword detected
		#define		CMT2310A_RSSI_UPDATE_PKT_DONE	(3<<2)					// rssi update by packet done
		
