timothy9079/solt_epd60/Projects/STM32WB5MM-DK/Applications/BLE/BLE_HeartRate/STM32CubeIDE/Device/Rf/inc/CMT2310A_reg.h
		#define		CMT2310A_COLL_DET_EN			(1<<0)					// 0=disable,  	1=enable collision detect

	#define 		CMT2310A_RX_RSSI_REG_01         0x63	 				// rf_rssi_reg 1, 	rssi_absolute_th[7:0]
		#define		CMT2310A_RSSI_ABS_TH_REG		0x63

	#define 		CMT2310A_RX_DOUT_REG_00         0x64					// rf_dout_reg, 	nc + nc + nc + dout_adjust_sel[2:0] + dout_adjust_mode + dout_adjust_en
		#define		CMT2310A_DOUT_ADJUST_SEL_MASK	(7<<2)
		#define		CMT2310A_DOUT_ADJUST_3_33		(0<<2)
		#define		CMT2310A_DOUT_ADJUST_6_66		(1<<2)
		#define		CMT2310A_DOUT_ADJUST_9_99		(2<<2)					
		#define		CMT2310A_DOUT_ADJUST_13_32		(3<<2)
		#define		CMT2310A_DOUT_ADJUST_16_65		(4<<2)
		#define		CMT2310A_DOUT_ADJUST_19_98		(5<<2)
		#define		CMT2310A_DOUT_ADJUST_23_21		(6<<2)
		#define		CMT2310A_DOUT_ADJUST_26_64		(7<<2)
		
		#define		CMT2310A_DOUT_ADJUST_MODE		(1<<1)					// 0=+1 duty, 	1=-1 duty
		#define		CMT2310A_DOUT_ADJUST_EN			(1<<0)					// 0=disable, 	1=enable dout adjust
		

	#define 		CMT2310A_RX_ANTD_REG_00         0x67					// rf_ant_reg		nc + nc + nc + nc + ant_wait_pmb[1:0] + ant_sw_dis + ant_div_en
		#define		CMT2310A_ANT_WAIT_PMB_MASK		(3<<2)
		#define		CMT2310A_ANT_WAIT_1_5_UNIT		(0<<2)					// wait preamble size *1.5, when antenna calibrate
		#define		CMT2310A_ANT_WAIT_2_UNIT		(1<<2)					// wait preamble size *2, when antenna calibrate
		#define		CMT2310A_ANT_WAIT_2_5_UNIT		(2<<2)					// wait preamble size *2.5, when antenna calibrate
		#define		CMT2310A_ANT_WAIT_3_UNIT		(3<<2)					// wait preamble size *3, when antenna calibrate
	
		#define		CMT2310A_ANT_SW_DIS				(1<<1)					// 0=enable, 	1=bypass antenna switch
		#define		CMT2310A_ANT_DIV_EN				(1<<0)					// 0=disable, 	1=enable antenna diversity

// --------------------------- CUS PAGE2 defines -----------------------------------------

	#define 		CMT2310A_FREQ_CHANL_00          0x00
	#define 		CMT2310A_FREQ_CHANL_01          0x01
	#define 		CMT2310A_FREQ_CHANL_02          0x02
	#define 		CMT2310A_FREQ_CHANL_03          0x03
	#define 		CMT2310A_FREQ_CHANL_04          0x04
	#define 		CMT2310A_FREQ_CHANL_05          0x05
	#define 		CMT2310A_FREQ_CHANL_06          0x06
	#define 		CMT2310A_FREQ_CHANL_07          0x07
	#define 		CMT2310A_FREQ_CHANL_08          0x08
	#define 		CMT2310A_FREQ_CHANL_09          0x09
	#define 		CMT2310A_FREQ_CHANL_10          0x0A
	#define 		CMT2310A_FREQ_CHANL_11          0x0B
	#define 		CMT2310A_FREQ_CHANL_12          0x0C
	#define 		CMT2310A_FREQ_CHANL_13          0x0D
	#define 		CMT2310A_FREQ_CHANL_14          0x0E
	#define 		CMT2310A_FREQ_CHANL_15          0x0F
	#define 		CMT2310A_FREQ_CHANL_16          0x10
	#define 		CMT2310A_FREQ_CHANL_17          0x11
	#define 		CMT2310A_FREQ_CHANL_18          0x12
	#define 		CMT2310A_FREQ_CHANL_19          0x13
	#define 		CMT2310A_FREQ_CHANL_20          0x14
	#define 		CMT2310A_FREQ_CHANL_21          0x15
	#define 		CMT2310A_FREQ_CHANL_22          0x16
	#define 		CMT2310A_FREQ_CHANL_23          0x17
	#define 		CMT2310A_FREQ_CHANL_24          0x18
	#define 		CMT2310A_FREQ_CHANL_25          0x19
	#define 		CMT2310A_FREQ_CHANL_26          0x1A
	#define 		CMT2310A_FREQ_CHANL_27          0x1B
	#define 		CMT2310A_FREQ_CHANL_28          0x1C
	#define 		CMT2310A_FREQ_CHANL_29          0x1D
	#define 		CMT2310A_FREQ_CHANL_30          0x1E
	#define 		CMT2310A_FREQ_CHANL_31          0x1F
	#define 		CMT2310A_FREQ_CHANL_32          0x20
	#define 		CMT2310A_FREQ_CHANL_33          0x21
	#define 		CMT2310A_FREQ_CHANL_34          0x22
	#define 		CMT2310A_FREQ_CHANL_35          0x23
	#define 		CMT2310A_FREQ_CHANL_36          0x24
	#define 		CMT2310A_FREQ_CHANL_37          0x25
	#define 		CMT2310A_FREQ_CHANL_38          0x26
	#define 		CMT2310A_FREQ_CHANL_39          0x27
	#define 		CMT2310A_FREQ_CHANL_40          0x28
	#define 		CMT2310A_FREQ_CHANL_41          0x29
	#define 		CMT2310A_FREQ_CHANL_42          0x2A
	#define 		CMT2310A_FREQ_CHANL_43          0x2B
	#define 		CMT2310A_FREQ_CHANL_44          0x2C
	#define 		CMT2310A_FREQ_CHANL_45          0x2D
	#define 		CMT2310A_FREQ_CHANL_46          0x2E
	#define 		CMT2310A_FREQ_CHANL_47          0x2F
	#define 		CMT2310A_FREQ_CHANL_48          0x30
	#define 		CMT2310A_FREQ_CHANL_49          0x31
	#define 		CMT2310A_FREQ_CHANL_50          0x32
	#define 		CMT2310A_FREQ_CHANL_51          0x33
	#define 		CMT2310A_FREQ_CHANL_52          0x34
	#define 		CMT2310A_FREQ_CHANL_53          0x35
	#define 		CMT2310A_FREQ_CHANL_54          0x36
	#define 		CMT2310A_FREQ_CHANL_55          0x37
	#define 		CMT2310A_FREQ_CHANL_56          0x38
	#define 		CMT2310A_FREQ_CHANL_57          0x39
	#define 		CMT2310A_FREQ_CHANL_58          0x3A
	#define 		CMT2310A_FREQ_CHANL_59          0x3B
	#define 		CMT2310A_FREQ_CHANL_60          0x3C
	#define 		CMT2310A_FREQ_CHANL_61          0x3D
	#define 		CMT2310A_FREQ_CHANL_62          0x3E
	#define 		CMT2310A_FREQ_CHANL_63          0x3F
	
	#define			CMT2310A_CHIP_VERSION_00		0x40
	#define			CMT2310A_CHIP_VERSION_01		0x41
	#define			CMT2310A_CHIP_VERSION_02		0x42

// -------------------------------- Marco defines ----------------------------------------- 
	#define 		VAL_BIT0                        0x01
	#define 		VAL_BIT1                        0x02
	#define 		VAL_BIT2                        0x04
	#define 		VAL_BIT3                        0x08
	#define 		VAL_BIT4                        0x10
	#define 		VAL_BIT5                        0x20
	#define 		VAL_BIT6                        0x40
	#define 		VAL_BIT7                        0x80
	        		
	#define 		BIT0                            0
	#define 		BIT1                            1
	#define 		BIT2                            2
	#define 		BIT3                            3
	#define 		BIT4                            4
	#define 		BIT5                            5
	#define 		BIT6                            6
	#define 		BIT7                            7 

	//## CMT2310A_CTL_REG_00 registers
	#define 		M_BOOT_MAIN                     VAL_BIT1
	#define 		M_POWERUP                     	VAL_BIT0

	//## CMT2310A_CTL_REG_01 registers
	#define 		M_GO_RXFS                     	VAL_BIT5
	#define 		M_GO_TXFS                     	VAL_BIT4
	#define 		M_GO_RX                       	VAL_BIT3
	#define 		M_GO_TX                       	VAL_BIT2
	#define 		M_GO_READY                    	VAL_BIT1
	#define 		M_GO_SLEEP                    	VAL_BIT0

	//##  CMT2310A_CTL_REG_02 registers 
	#define 		M_MCU_GPIO_EN                   VAL_BIT2
	#define 		M_ANT_DIV_MANU                  VAL_BIT1
	#define 		M_ANT_SELECT                    VAL_BIT0

	//## CMT2310A_CTL_REG_04 registers
	#define 		M_TX_DIN_EN                  	VAL_BIT6
	#define	 		M_GPIO1_SEL                    	(VAL_BIT5|VAL_BIT4|VAL_BIT3)
	#define 		M_GPIO0_SEL                     (VAL_BIT2|VAL_BIT1|VAL_BIT0)
	
	//## CMT2310A_CTL_REG_05 registers
	#define 		M_TX_DIN_SEL                   	(VAL_BIT7|VAL_BIT6)
	#define 		M_GPIO3_SEL                     (VAL_BIT5|VAL_BIT4|VAL_BIT3)
	#define 		M_GPIO2_SEL                     (VAL_BIT2|VAL_BIT1|VAL_BIT0)
	
