timothy9079/solt_epd60/Projects/STM32WB5MM-DK/Applications/BLE/BLE_HeartRate/STM32CubeIDE/Device/Rf/inc/CMT2310A_reg.h
	//## CMT2310A_CTL_REG_06 registers
	#define 		M_DIG_CLKOUT_EN                	VAL_BIT6
	#define 		M_GPIO5_SEL                     (VAL_BIT5|VAL_BIT4|VAL_BIT3)
	#define 		M_GPIO4_SEL                     (VAL_BIT2|VAL_BIT1|VAL_BIT0)
	
	//## CMT2310A_CTL_REG_07 registers     
	#define 		M_LFXO_PAD_EN                  	VAL_BIT5
	#define 		M_API_STOP                     	VAL_BIT4
	#define 		M_SPI_3W_EN                    	VAL_BIT3
	#define 		M_NIRQ_SEL                     	(VAL_BIT2|VAL_BIT1|VAL_BIT0)

	//## CMT2310A_CTL_REG_09 registers
	#define 		M_API_CMD_FLAG                  VAL_BIT7
	#define 		M_API_RESP                      (VAL_BIT6|VAL_BIT5|VAL_BIT4|VAL_BIT3|VAL_BIT2|VAL_BIT1|VAL_BIT0)
	
	//## CMT2310A_CTL_REG_10 registers
	#define 		M_STATE_IS_TX                   VAL_BIT5
	#define 		M_STATE_IS_RX                   VAL_BIT4
	#define 		M_STATE_IS_TFS                  VAL_BIT3
	#define 		M_STATE_IS_RFS                  VAL_BIT2
	#define 		M_STATE_IS_READY                VAL_BIT1
	#define 		M_STATE_IS_SLEEP                VAL_BIT0
	
	//## CMT2310A_CTL_REG_14 registers
	#define 		M_RX_FIFO_FULL_RX_EN            VAL_BIT7
	#define 		M_RX_FIFO_NMTY_RX_EN            VAL_BIT6
	#define 		M_RX_FIFO_TH_RX_EN              VAL_BIT5
	#define 		M_RX_FIFO_OVF_EN                VAL_BIT3
	#define 		M_TX_FIFO_FULL_EN               VAL_BIT2
	#define 		M_TX_FIFO_NMTY_EN               VAL_BIT1
	#define 		M_TX_FIFO_TH_EN                 VAL_BIT0

	//## CMT2310A_CTL_REG_15 registers
 	#define 		M_ANT_INSTR                     VAL_BIT0

	//## CMT2310A_CTL_REG_16 registers
	#define 		M_INT1_SEL                      (VAL_BIT5|VAL_BIT4|VAL_BIT3|VAL_BIT2|VAL_BIT1|VAL_BIT0)

	//## CMT2310A_CTL_REG_17 registers
	#define 		M_INT1_POLAR    	           	VAL_BIT7
	#define 		M_INT2_POLAR                   	VAL_BIT6
	#define 		M_INT2_SEL                      (VAL_BIT5|VAL_BIT4|VAL_BIT3|VAL_BIT2|VAL_BIT1|VAL_BIT0)
	
	//## CMT2310A_CTL_REG_18 registers
	#define 		M_SLEEP_TMO_EN                 	VAL_BIT7
	#define 		M_RX_TMO_EN                    	VAL_BIT6
	#define 		M_TX_DONE_EN                   	VAL_BIT5
	#define 		M_PREAM_PASS_EN                	VAL_BIT4
	#define 		M_SYNC_PASS_EN                 	VAL_BIT3
	#define 		M_ADDR_PASS_EN                 	VAL_BIT2
	#define 		M_CRC_PASS_EN                  	VAL_BIT1
	#define 		M_PKT_DONE_EN                  	VAL_BIT0
	
	//## CMT2310A_CTL_REG_19 registers
	#define 		M_PD_FIFO                    	VAL_BIT6
	#define 		M_FIFO_TH_8         	    	VAL_BIT5
	#define 		M_FIFO_AUTO_CLR_RX_EN        	VAL_BIT4
	#define 		M_FIFO_AUTO_RES_TX_EN        	VAL_BIT3
	#define 		M_FIFO_TX_TEST_EN            	VAL_BIT2
	#define 		M_FIFO_MERGE_EN              	VAL_BIT1
	#define 		M_FIFO_TX_RX_SEL             	VAL_BIT0
	
	//## CMT2310A_CTL_REG_21 registers
	#define 		M_RSSI_PJD_VALID_EN             VAL_BIT6
	#define 		M_OP_CMD_FAILED_EN              VAL_BIT5
	#define 		M_RSSI_COLL_EN                  VAL_BIT4
	#define 		M_PKT_ERR_EN                    VAL_BIT3
	#define 		M_LBD_STATUS_EN                 VAL_BIT2
	#define 		M_LBD_STOP_EN                   VAL_BIT1
	#define 		M_LD_STOP_EN                    VAL_BIT0
	
	//## CMT2310A_CTL_REG_22 registers                    
	#define 		M_FREQ_HOP_MANU_EN              VAL_BIT7
	#define 		M_RX_HOP_PERSIST                VAL_BIT5
	#define 		M_FREQ_SW_STATE                 VAL_BIT6
	#define 		M_TX_DATA_INV                   VAL_BIT4
	#define 		M_PA_DIFF_SEL                   VAL_BIT3
	#define 		M_TRX_SWT_INV                   VAL_BIT2
	#define 		M_TRX_SWT_EN                    VAL_BIT1
	#define 		M_ANT_LOCK_EN                   VAL_BIT0
	
	//## CMT2310A_CTL_REG_23 registers
	#define 		M_API_DONE_EN                 	VAL_BIT7
	#define 		M_CCA_STATUS_EN               	VAL_BIT6
	#define 		M_CSMA_DONE_EN                 	VAL_BIT5
	#define 		M_TX_DC_DONE_EN                	VAL_BIT4
	#define 		M_ACK_RECV_FAILED_EN          	VAL_BIT3
	#define 		M_TX_RESEND_DONE_EN            	VAL_BIT2
	#define 		M_NACK_RECV_EN                	VAL_BIT1
	#define 		M_SEQ_MATCH_EN                	VAL_BIT0
	
	//## CMT2310A_CTL_REG_24 registers 
	#define 		M_SLEEP_TMO_FLG              	VAL_BIT5
	#define 		M_RX_TMO_FLG                 	VAL_BIT4
	#define 		M_TX_DONE_FLG                	VAL_BIT3
	#define 		M_SLEEP_TMO_CLR              	VAL_BIT2 
	#define 		M_RX_TMO_CLR                 	VAL_BIT1
	#define 		M_TX_DONE_CLR                	VAL_BIT0
	
	//## CMT2310A_CTL_REG_25 registers
	#define 		M_PREAM_PASS_CLR               	VAL_BIT4
	#define 		M_SYNC_PASS_CLR                	VAL_BIT3
	#define 		M_ADDR_PASS_CLR                	VAL_BIT2
	#define 		M_CRC_PASS_CLR                 	VAL_BIT1
	#define 		M_PKT_DONE_CLR                 	VAL_BIT0
	
	//## CMT2310A_CTL_REG_26 registers
	#define 		M_SYNC1_PASS_FLG                VAL_BIT5
	#define 		M_PREAM_PASS_FLG                VAL_BIT4
	#define 		M_SYNC_PASS_FLG                 VAL_BIT3
	#define 		M_ADDR_PASS_FLG                 VAL_BIT2
	#define 		M_CRC_PASS_FLG                  VAL_BIT1
	#define 		M_PKT_DONE_FLG                  VAL_BIT0
	
	//## CMT2310A_CTL_REG_27 registers
	#define 		M_TX_FIFO_RESTORE             	VAL_BIT2
	#define 		M_RX_FIFO_CLR                 	VAL_BIT1
	#define 		M_TX_FIFO_CLR                 	VAL_BIT0
	
	//## CMT2310A_CTL_REG_28 registers
	#define 		M_RX_FIFO_FULL_FLG            	VAL_BIT7
	#define 		M_RX_FIFO_NMTY_FLG            	VAL_BIT6
	#define 		M_RX_FIFO_TH_FLG              	VAL_BIT5
	#define 		M_RX_FIFO_OVF_FLG             	VAL_BIT3
	#define 		M_TX_FIFO_FULL_FLG            	VAL_BIT2
	#define 		M_TX_FIFO_NMTY_FLG            	VAL_BIT1
	#define 		M_TX_FIFO_TH_FLG              	VAL_BIT0
	
	//## CMT2310A_CTL_REG_29 registers 
	#define 		M_ANT_LOCK_CLR                    VAL_BIT4
	#define 		M_OP_CMD_FAILED_CLR               VAL_BIT3
	#define 		M_RSSI_COLL_CLR                   VAL_BIT2
	#define 		M_PKT_ERR_CLR                     VAL_BIT1
	#define 		M_LBD_STATUS_CLR                  VAL_BIT0
	
	//## CMT2310A_CTL_REG_30 registers
	#define 		M_ANT_LOCK_FLG                    VAL_BIT4
	#define 		M_OP_CMD_FAILED_FLG               VAL_BIT3
	#define 		M_RSSI_COLL_FLG                   VAL_BIT2
	#define 		M_PKT_ERR_FLG                     VAL_BIT1
	#define 		M_LBD_STATUS_FLG                  VAL_BIT0

	
	//## CMT2310A_CTL_REG_31 registers
	#define 		M_API_DONE_CLR                    VAL_BIT7
	#define 		M_CCA_STATUS_CLR                  VAL_BIT6
	#define 		M_CSMA_DONE_CLR                   VAL_BIT5
	#define 		M_TX_DC_DONE_CLR                  VAL_BIT4
	#define 		M_ACK_RECV_FAILED_CLR             VAL_BIT3
	#define 		M_TX_RESEND_DONE_CLR              VAL_BIT2
	#define 		M_NACK_RECV_CLR                   VAL_BIT1
	#define 		M_SEQ_MATCH_CLR                   VAL_BIT0
	
	//##  CMT2310A_CTL_REG_32 registers
	#define 		M_API_DONE_FLG                    VAL_BIT7
	#define 		M_CCA_STATUS_FLG                  VAL_BIT6
	#define 		M_CSMA_DONE_FLG                   VAL_BIT5
	#define 		M_TX_DC_DONE_FLG                  VAL_BIT4
	#define 		M_ACK_RECV_FAILED_FLG             VAL_BIT3
	#define 		M_TX_RESEND_DONE_FLG              VAL_BIT2
	#define 		M_NACK_RECV_FLG                   VAL_BIT1
	#define 		M_SEQ_MATCH_FLG                   VAL_BIT0

	//## CMT2310A_CTL_REG_126 registers 
	#define 		M_HV_PAGE_SEL                     (VAL_BIT7|VAL_BIT6)

	//##  CMT2310A STATE 
	#define 		STATE_IS_IDLE                	0x00 
	#define 		STATE_IS_SLEEP               	0x81 
	#define 		STATE_IS_READY               	0x82
	#define 		STATE_IS_RFS                 	0x84
	#define 		STATE_IS_TFS                 	0x88
	#define 		STATE_IS_RX                  	0x90
	#define 		STATE_IS_TX                  	0xA0
	
	//##  GPIO0_SEL 
	#define 		GPIO0_SEL_DOUT                	0x00
	#define 		GPIO0_SEL_INT1                	0x01 
	#define 		GPIO0_SEL_INT2                	0x02 
	#define 		GPIO0_SEL_DCLK                	0x03 
	
	//##  GPIO1_SEL 
	#define 		GPIO1_SEL_DCLK                	0x00
	#define 		GPIO1_SEL_INT1                	0x01 
	#define 		GPIO1_SEL_INT2                	0x02 
	#define 		GPIO1_SEL_DOUT                	0x03 
	
	//##  GPIO2_SEL 
	#define 		GPIO2_SEL_INT1                 	0x00
	#define 		GPIO2_SEL_INT2                 	0x01 
	#define 		GPIO2_SEL_DCLK                 	0x02 
	#define 		GPIO2_SEL_DOUT                 	0x03 
	
	//##  GPIO3_SEL 
	#define 		GPIO3_SEL_INT2                	0x00
	#define 		GPIO3_SEL_INT1                	0x01 
	#define 		GPIO3_SEL_DCLK                	0x02 
	#define 		GPIO3_SEL_DOUT                	0x03 
	#define 		GPIO3_SEL_DIN                 	0x05 
	
	//##  GPIO4_SEL 
	#define 		GPIO4_SEL_DOUT                	0x00
	#define 		GPIO4_SEL_INT1                	0x01 
	#define 		GPIO4_SEL_INT2                	0x02 
	#define 		GPIO4_SEL_DCLK                	0x03 
	#define 		GPIO4_SEL_DIN                 	0x05 
	
