timothy9079/solt_epd60/Projects/STM32WB5MM-DK/Applications/BLE/BLE_HeartRate/STM32CubeIDE/Device/Rf/inc/CMT2310A_reg.h
	//## GPIO5_SEL 
	#define 		GPIO5_SEL_RSTN                	0x00
	#define 		GPIO5_SEL_INT1                	0x01 
	#define 		GPIO5_SEL_INT2                	0x02 
	#define 		GPIO5_SEL_DOUT                	0x03 
	#define 		GPIO5_SEL_DCLK                	0x04 
	
	//## TX_DIN_SEL 
	#define 		TX_DIN_SEL_GPIO3              	0x00
	#define 		TX_DIN_SEL_GPIO4              	0x01 
	#define 		TX_DIN_SEL_NIRQ               	0x02
	
	//## NIRQ_SEL
	#define 		NIRQ_SEL_INT1                 	0x00
	#define 		NIRQ_SEL_INT2                 	0x01 
	#define 		NIRQ_SEL_DCLK                 	0x02 
	#define 		NIRQ_SEL_DOUT                 	0x03 
	#define 		NIRQ_SEL_DIN                  	0x04
	
	//## INT1/2_SEL 
	#define 		INT_SRC_MIX                     0x00
	#define 		INT_SRC_ANT_LOCK                0x01
	#define 		INT_SRC_RSSI_PJD_VALID          0x02
	#define 		INT_SRC_PREAM_PASS              0x03
	#define 		INT_SRC_SYNC_PASS               0x04
	#define 		INT_SRC_ADDR_PASS               0x05
	#define 		INT_SRC_CRC_PASS                0x06
	#define 		INT_SRC_PKT_OK                  0x07
	#define 		INT_SRC_PKT_DONE                0x08
	#define 		INT_SRC_SLEEP_TMO               0x09
	#define 		INT_SRC_RX_TMO                  0x0A
	#define 		INT_SRC_RX_FIFO_NMTY            0x0B
	#define 		INT_SRC_RX_FIFO_TH              0x0C
	#define 		INT_SRC_RX_FIFO_FULL            0x0D
	#define 		INT_SRC_RX_FIFO_WBYTE           0x0E
	#define 		INT_SRC_RX_FIFO_OVF             0x0F
	#define 		INT_SRC_TX_DONE                 0x10
	#define 		INT_SRC_TX_FIFO_NMTY            0x11
	#define 		INT_SRC_TX_FIFO_TH              0x12
	#define 		INT_SRC_TX_FIFO_FULL            0x13
	#define 		INT_SRC_STATE_IS_READY          0x14
	#define 		INT_SRC_STATE_IS_FS             0x15
	#define 		INT_SRC_STATE_IS_RX             0x16
	#define 		INT_SRC_STATE_IS_TX             0x17
	#define 		INT_SRC_LBD_STATUS              0x18
	#define 		INT_SRC_API_CMD_FAILED          0x19
	#define 		INT_SRC_API_DONE                0x1A
	#define 		INT_SRC_TX_DC_DONE              0x1B
	#define 		INT_SRC_ACK_RECV_FAILED         0x1C
	#define 		INT_SRC_TX_RESEND_DONE          0x1D
	#define 		INT_SRC_NACK_RECV               0x1E
	#define 		INT_SRC_SEQ_MATCH               0x1F
	#define 		INT_SRC_CSMA_DONE               0x20
	#define 		INT_SRC_CCA_STATUS              0x21

#endif

//******************************************************************************
//* EOF (not truncated)
//******************************************************************************
